{"meta":{"title":"Down to the Rabbit Hole","subtitle":null,"description":null,"author":"crvdgc","url":"http://crvdgc.me"},"pages":[{"title":"about","date":"2018-07-24T09:51:30.000Z","updated":"2018-07-24T10:03:38.350Z","comments":true,"path":"about/index.html","permalink":"http://crvdgc.me/about/index.html","excerpt":"","text":"Down to the Rabbit Hole兔子洞中到底有什么呢？ 这是一个科幻＋计算机爱好者的小站。 关注二进制、放映机、方向键和多巴胺的一切。 联系方式 Github: https://www.github.com/crvdgc/ 微信: yokis1997 友情链接： 微信公众号： 老火箭酒吧 laorocketbar"}],"posts":[{"title":"PKD 电子梦评论 - Real Life / Exhibit Piece","slug":"electricDreams-01","date":"2018-07-25T07:22:46.000Z","updated":"2018-07-25T12:06:57.753Z","comments":true,"path":"2018/07/25/electricDreams-01/","link":"","permalink":"http://crvdgc.me/2018/07/25/electricDreams-01/","excerpt":"","text":"PKD 电子梦 评论 - Real Life / Exhibit Piece[TOC] 电子梦系列PKD 的作品，改编成为电视剧、电影的不在少数。但我还是对《电子梦》抱有独特期待的。不同于以往短篇改电影（《少数派报告》），长篇改电影（《银翼杀手》），长篇改电视剧（《高堡奇人》），《电子梦》将 PKD 的短篇改编成单元剧。每一篇小说独立，每一集剧也独立。短篇小说是最能体现科幻“点子小说”特点的载体。没有了人物和情节的负担，小说可以尽情发挥某个点子设定。身为 PKD 迷，怎么能错过这部剧呢？ 不过看了剧之后，感觉有几集水平真心一般。故从攒着买全集的钱里拨款，买了一本对应小说集，看看原作是否如此。本系列博客对应于每一集每一篇的评论。 &lt;&lt;&lt;&lt; 主要剧透预警 &gt;&gt;&gt;&gt; Quick RecapReal Life 剧集的主角有两位，一位是 Sarah ，未来世界的女同警察，一次针对警察的屠杀的幸存者，另一位是 George ，生活在现代的布鲁斯韦恩——拥有巨额财产却热衷于亲自行侠仗义打击犯罪。准确来讲，两个人共享思想和记忆，因此只是一个人的两个身份——问题在于，哪个身份是真的？ 两人分别在自己的世界中，通过 VR 设备进入到另一个世界和身份中。他们的爱人 Katie 名字相同，长相也相同，他们都在追查同一个姓名的罪犯。甚至来到同一家餐厅吃着同样的汉堡。区别在于，未来世界的生活“too good to be true”。在现代世界中， George 的妻子被罪犯报复残忍杀害，追捕罪犯也以失败告终。未来世界中， Sarah 不仅家庭美满，也成功抓到了罪犯。 两个 VR 项目都是捕捉潜意识中的愿望，将其转化为体验的。一个世界是以另一个世界为基础想象出来的。 如果 Sarah 的身份是虚假的，那么这个未来世界仅仅是一个“科幻世界”，里面有飞车、女同、幸福的家庭、成功抓捕到了罪犯，一切都是为了缓解丧妻之痛的幻想。 如果 George 的生活是虚假的，现实世界是 Sarah 的赎罪场，用自己的幻想折磨自己，以此发泄自己不配有这样幸福生活的自卑和愧疚——幸存者常有的心理障碍 survivor’s guilt，凭什么我能活下来。 对于 Sarah 的过去有清晰的记忆，而 George 的过去则需经人提醒才能慢慢想起。最终，他/她选择了 George 的生活，打碎了 VR 设备。未来世界的妻子看着自己的爱人迷失在 VR 世界中——原来这个世界才是真实的。 “为什么她选择了那样的人生？” “因为她想被自己的罪过惩罚，无论是真实的，还是虚构的。” Exhibit Piece根据 wiki 中的链接，本篇小说已经进入公共领域了。这里可以找到电子版和PDF版。 小说的主角 George Miller 是未来高压社会下的一名历史研究员，专门研究 20 世纪 50 年代的历史（本篇小说最初发表时间 1954 年）。为了研究的氛围，他平时身着那个年代的服装（在未来则属于奇装异服）。在一次和上司的冲突后， 他被展品——一个 50 年代生活的复制品——中的声音所吸引而进入了展品中。在那里，他回忆起了自己在其中的生活，一个妻子，两个孩子，有些令人担心的上司。 他感到困惑，因此找到了过去世界中的心理医生 Grunberg ，对方认为两套理论同样有说服力，但 George 却提出了第三个理论——两个世界都是真实的。医生建议他回到自己在世界中移动的点上，这样就能确定哪个世界是真实的。 他在那里见到了自己未来世界的同事和上司，他们认定 George 患了狂想症，威胁他要将他安乐死，并将展品拆除。 George 认为未来的高压社会没有什么值得生活的。与之相比，50 年代竟然成为了自由的黄金年代。 George 表示，展品实际上是一个时空门，他通过它回到了过去，而其他人无法回去。拆除展品只是毁坏了时空门，他将永远留在过去——正是他所希望的。 当 George 回到家中拿起报纸时，却发现上面写着，俄罗斯展示钴炸弹，全世界将面临毁灭。 究竟未来世界是他的幻想，还是他真的相信自己的展品是一个真实的世界，因为展品的拆除才出现了炸弹的新闻。抑或他真的回到了过去，炸弹的出现才是导致未来社会高压的原因。 评论改编剧中几乎没有留下什么，但两篇的主题都是“变换的现实”——一个 PKD 作品中经常出现的主题。如果我们对于现实的认知不能超过感官所及，那么又怎能区分“真实的现实”和“虚拟的现实”。《黑客帝国》中探讨过相同的主题，然而这一篇与《攻壳机动队》中更进一步，如果连思想和记忆都可以进行虚拟，不仅世界的真实性变得不可靠，连自我的真实性都无法决定了。 看过《银翼杀手》的同学一定会对此感到熟悉，仿生人通过虚假记忆不知道自己是仿生人，这是一个核心设定，《银翼杀手2049》中，仿生人知道自己是仿生人，且知道自己有虚假的记忆，一下将揭示虚假记忆所展现的力量削弱到几乎没有了。 PKD 自己也经常怀疑所处的世界是否为真实，一如他笔下的人物，他又无法最终抉择究竟哪种世界为真，因此作品的结局常常是含糊的。改编中给出了明确的答案，因此转变成了对虚拟现实这一万能许愿机的警告。 此外，在面对多个可能的真实时，人总是需要选择一种“自己的真实”，也即相信哪一个真实才是“真实的真实”。在选择的过程中，一种标准是，一定要活在真实中，也就是选择最像真实的那个真实。另一种标准是，只要活在自己最喜欢的真实即可。除了选中的真实以外，其他世界中的人都会觉得你在有意无意地“欺骗自己”。 虽然两个故事都没有展示，不过发现自己的选择错误也是一个有趣的点。比如剧中，与虚拟人物热情相拥，但却看到整个世界渐渐陷入黑暗，会怎么想呢？后悔自己的决定？还是坚持自己的选择？ PKD 提出了问题，意识到自己没有能力去回答，因此他提出了更多的问题。 《电子梦》的执行出品人 Ronald D. Moore （《太空堡垒卡拉狄加》、《星际迷航7》、《星际迷航8》、《星际迷航：下一代》）为本篇写了导读。他在其中表达了对今年来虚拟现实技术的关注，因此将 VR 项目引入到了故事中。实际上，他自己作为编剧写过一部探讨虚拟现实的电影 Virtuality 。 PKD 的时代已经出现了 VR 技术的先声，尽管 PKD 并没有明确的展示使用何种设备进入虚拟的现实。但他的作品无疑谈及了更广泛意义上的模拟现实（Simulated Reality），甚至不是模拟，而是另一种完全不同的现实。","categories":[{"name":"科幻","slug":"科幻","permalink":"http://crvdgc.me/categories/科幻/"},{"name":"评论","slug":"科幻/评论","permalink":"http://crvdgc.me/categories/科幻/评论/"}],"tags":[{"name":"pkd","slug":"pkd","permalink":"http://crvdgc.me/tags/pkd/"},{"name":"剧集","slug":"剧集","permalink":"http://crvdgc.me/tags/剧集/"},{"name":"cyberpunk","slug":"cyberpunk","permalink":"http://crvdgc.me/tags/cyberpunk/"},{"name":"虚拟现实","slug":"虚拟现实","permalink":"http://crvdgc.me/tags/虚拟现实/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-07-24T09:44:25.337Z","updated":"2018-07-24T09:44:25.333Z","comments":true,"path":"2018/07/24/hello-world/","link":"","permalink":"http://crvdgc.me/2018/07/24/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new postthis is a change test 1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}